#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("ТипСклада") Тогда
		ТипСкладаОтбор = Параметры.ТипСклада;
		УстановитьОтборПоТипу();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТипСкладаОтборПриИзменении(Элемент)

	УстановитьОтборПоТипу();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьОтборПоТипу()

	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТипСклада");
	ЭлементОтбора.ПравоеЗначение = ТипСкладаОтбор;
	ЭлементОтбора.Использование = ЗначениеЗаполнено(ТипСкладаОтбор);

КонецПроцедуры

#КонецОбласти
