#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.ТипСклада = Перечисления.ТипыСкладов.Оптовый;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	Оповестить("Запись_Склады", , Объект.Ссылка);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "Запись_Сотрудники" Тогда
		Прочитать();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТипСкладаПриИзменении(Элемент)

	ТипСкладаПриИзмененииНаСервере();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ТипСкладаПриИзмененииНаСервере()

	Если Объект.ТипСклада = Перечисления.ТипыСкладов.Розничный Тогда
		Элементы.Ответственный.АвтоОтметкаНезаполненного = Истина;
	Иначе
		Элементы.Ответственный.АвтоОтметкаНезаполненного = Ложь;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПроверитьОтветственного()

	ПоказатьПредупреждение(, НСтр("ru = 'Для розничного склада нужен ответственный'"));

КонецПроцедуры

#КонецОбласти
