#Область СлужебныйПрограммныйИнтерфейс

// Для вызова из модулей форм документов и расширенной реализации.

// Обработчик события ПриСозданииНаСервере формы документа.
//	Заполняет новый документ значениями по умолчанию
//	и настраивает выбор склада.
//
// Параметры:
// 	Форма - ФормаКлиентскогоПриложения - форма, которая создается.
// 	Отказ - Булево - признак отказа от создания формы.
// 	СтандартнаяОбработка - Булево - признак выполнения стандартной обработки события.
//
Процедура ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт

	// Первоначальное заполнение объекта.
	Если Форма.Параметры.Ключ.Пустая() Тогда

		Форма.ЗаполнитьПервоначальныеЗначения();
		Форма.ПриПолученииДанныхНаСервере();

	КонецЕсли;

	ТипыСклада = Метаданные.Документы.ПоступлениеТоваров.Реквизиты.Склад.Тип.Типы();
	Если ТипыСклада.Количество() > 1 Тогда
		ТипыДляУдаления = Новый Массив;
		Для Каждого ТипСклада Из ТипыСклада Цикл
			Если ТипСклада <> Тип("СправочникСсылка.Склады") Тогда
				ТипыДляУдаления.Добавить(ТипСклада);
			КонецЕсли;
		КонецЦикла;
		Для Каждого ТипДляУдаления Из ТипыДляУдаления Цикл
			ТипыСклада.Удалить(ТипыСклада.Найти(ТипДляУдаления));
		КонецЦикла;
		Форма.Элементы.Склад.ОграничениеТипа = Новый ОписаниеТипов(ТипыСклада);
	КонецЕсли;
	Форма.Элементы.Склад.ВыбиратьТип = ТипыСклада.Количество() > 1;

КонецПроцедуры

#КонецОбласти
