#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	Если ТипСклада = Перечисления.ТипыСкладов.Розничный
		И Не ЗначениеЗаполнено(Ответственный) Тогда
		ОбщегоНазначения.СообщитьПользователю("Для розничного склада укажите ответственного", ЭтотОбъект,
			"Ответственный", , Отказ);
	КонецЕсли;

КонецПроцедуры

Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если Не ЭтоНовый() Или ЗначениеЗаполнено(ТипСклада) Тогда
		Возврат;
	КонецЕсли;
	ТипСклада = ТипСкладаПоУмолчанию();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТипСкладаПоУмолчанию()

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Склады.ТипСклада КАК ТипСклада
	|ИЗ
	|	Справочник.Склады КАК Склады
	|ГДЕ
	|	НЕ Склады.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Склады.Код";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ТипСклада;
	КонецЕсли;
	Возврат Перечисления.ТипыСкладов.Оптовый;

КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
